var title       = [];
var tags        = [];
var description = [];
var address     = [];
var sum         = 18;

title[1]       = 'Испытания технических средств';
tags[1]        = 'диагностика диагностирование проверить проверка испытание испытания технических средств средства тестирование тесты проверка проверки';
description[1] = 'Испытания на электромагнитную совместимость, на холодо- и теплопрочност и высоковольтные испытания';
address[1]     = 'https://etl.nstu.ru/src/testing.html';

title[2]       = 'Диагностика электрооборудования';
tags[2]        = 'визуальный осмотр испытания и измерения параметров заземляющего устройства проверка цепи фаза-нуль (цепи зануления) в электроустановках до 1 кВ с глухим заземлением нейтрали испытания устройств защитного отключения (УЗО) Измерение сопротивления изоляции силовых кабельных линий, электрических аппаратов, вторичных цепей и электропроводки наведённых напряжений на ВЛ 0,4-220 кВ параметров систем молниезащиты электрооборудования повышенным напряжением промышленной частоты диагностика диагностирование проверить проверка испытание испытания технических средств средства тестирование тесты проверка проверки';
description[2] = 'Визуальный осмотр, проферка цепи фаза-нуль, испытания устройств защитного отключения и другие виды диагностики';
address[2]     = 'https://etl.nstu.ru/src/diagnostics.html';

title[3]       = 'Проектирование';
tags[3]        = 'сро СРО свидетельство проектирование внешние внутренние внешних и внутренних системы электроснабжения систем электроснабжения высоковольтных линий линии подстанций подстанции';
description[3] = 'Проектирование систем электроснабжения, высоковольтный линий и подстанций';
address[3]     = 'https://etl.nstu.ru/src/design.html';

title[4]       = 'Услуги';
tags[4]        = 'услуги услуга грузоупорность повышение измерить оборудование разработка испытать испытание регистрация расчёты перенапряжений исследование переходных процессов переходные процессы частотно-зависимого устройства частотно-зависимое устройство ЧЗУ чзу высокочастотные перенапряжения при коммутациях реактора реактор коммутации элегазовым выключателем элегазовый выключатель выявление опасных опасные обосновывающие материалы и расчеты к экспертному заключению заключение причина причины несчастный случай чп ЧП чс ЧС о причинах несчастного случая со смертельным исходом летальный исход трубопровод воздушная линия воздействие переменного тока переменный ток Участие в разработке руководящего документа методика определение воздействия коррозию коррозия нефтепровода нефтепровод защита защите трубопровода турбопровод оценка оценить несущих несущие конструкций конструкции электроустановках электроустановки сравнение определение коррозия коррозийное корроз оттяжка оттяжки арматура опоры изоляция проведение измерений феррорезонанса феррорезонанс трансформаторов трансформаторы трансформатор реактивная мощнсоть компенсация установка установить магнитные поля высокое ву ВУ оптокабель оптический кабель подвес подвесить самонесущий изоляция опоры композит композитные АЧХ амплитуда характеристика плавка гололёд система амплитудно-частотная характеристика';
description[4] = 'Повышение грозоупорности объектов электроэнергетики, разработка испытательного и измерительного оборудования, регистрация и расчёты перенапряжений в первичных и вторичных цепях электрооборудования и электроустановок высокого напряжения и прочие работы';
address[4]     = 'https://etl.nstu.ru/src/scientific.html';

title[5]       = 'Наши разработки';
tags[5]        = 'разработка пример примеры разработка услуга разработки услуги';
description[5] = 'Генератор импульсов тока прямоугольной формы, апериодической формы, комплект аппаратуры для измерения значений наведенного напряжения, системы мониторинга помех во вторичных цепях';
address[5]     = 'https://etl.nstu.ru/src/development.html';

title[6]       = 'Генератор импульсов тока прямоугольной формы';
tags[6]        = 'генератор импульсов тока прямоугольной формы испытание варисторов варисторы';
description[6] = 'Генератор импульсов тока прямоугольной формы и его описание';
address[6]     = 'https://etl.nstu.ru/src/dev1.html';

title[7]       = 'Генератор импульсов тока апериодической формы';
tags[7]        = 'испытание варисторов варисторы генератор импульсов тока апериодической формы';
description[7] = 'Генератор импульсов тока апериодической формы и его описание';
address[7]     = 'https://etl.nstu.ru/src/dev2.html';

title[8]       = 'Комплект аппаратуры для измерения значений наведенного напряжения';
tags[8]        = 'комплект аппаратуры для измерения значений наведенного напряжения измерение напражение';
description[8] = 'Комплект аппаратуры для измерения значений наведенного напряжения и его описание';
address[8]     = 'https://etl.nstu.ru/src/dev3.html';

title[9]       = 'Системы мониторинга помех во вторичных цепях';
tags[9]        = 'Системы система пониторинг помехи удар молнии молния внешнее возмущение внешние возмущения вторцепи вторцепь мониторинга помех во вторичных цепях';
description[9] = 'Комплект аппаратуры для измерения значений наведенного напряжения и его описание';
address[9]     = 'https://etl.nstu.ru/src/dev4.html';

title[10]       = 'Испытания на электромагнитную совместимость';
tags[10]        = 'электромагнитная совместимость имитатор провалы напражения перенапряжения перенапряжение напряжение провалов напряжения и перенапряжений ИПНП';
description[10] = 'Испытательное оборудование: имитатор провалов напряжения и перенапряжений ИПНП';
address[10]     = 'https://etl.nstu.ru/src/gost%204.11.html';

title[11]       = 'Испытания на электромагнитную совместимость';
tags[11]        = 'электромагнитная совместимость имитатор провалы напражения пачки помех пачек помех токовые клещи перенапряжения перенапряжение напряжение провалов напряжения и перенапряжений ИПНП';
description[11] = 'Испытательное оборудование: имитатор пачек помех ИПП-4000 с токовыми клещами';
address[11]     = 'https://etl.nstu.ru/src/gost%204.4.html';

title[12]       = 'Испытания на электромагнитную совместимость';
tags[12]        = 'электромагнитная совместимость микросекундным импульсным микросекунды имитатор провалы напражения пачки помех пачек помех перенапряжения перенапряжение напряжение провалов напряжения и перенапряжений ИПНП';
description[12] = 'Имитатор импульсных помех ИИП-4000 (ссылка 4), имитатор импульсных помех ИИП-2000';
address[12]     = 'https://etl.nstu.ru/src/gost%204.5.html';

title[13]       = 'Испытания на электромагнитную совместимость';
tags[13]        = 'электромагнитная совместимость устойчивость к контактным и воздушным разряды электростатика электростатическим разрядам имитатор провалы напражения пачки помех пачек помех перенапряжения перенапряжение напряжение провалов напряжения и перенапряжений ИПНП';
description[13] = 'Имитатор электростатических разрядов ЭСР-8000К с разрядными блоками ЭСР-8000К и ЭСР-1500';
address[13]     = 'https://etl.nstu.ru/src/gost%204.2.html';

title[14]       = 'Высоковольтные испытания';
tags[14]        = 'Высоковольтные испытания Испытания повышенным напряжением промышленной частоты установка высоковольтная испытательная, состав: испытательный трансформатор ИОМ-100 киловольтметр КВЦ-120А-1,0';
description[14] = 'Испытания повышенным напряжением промышленной частоты';
address[14]     = 'https://etl.nstu.ru/src/vi1.html';

title[15]       = 'Высоковольтные испытания';
tags[15]        = 'Высоковольтные испытания генератор импульсных напряжений ГИН';
description[15] = 'Испытания полным грозовым импульсом';
address[15]     = 'https://etl.nstu.ru/src/vi2.html';

title[16]       = 'Высоковольтные испытания';
tags[16]        = 'Высоковольтные испытания измеритель сопротивления изоляции 2804 IN';
description[16] = 'Измерение сопротивления изоляции оборудования.';
address[16]     = 'https://etl.nstu.ru/src/vi3.html';

title[17]       = 'Испытания на холодо- и теплопрочность';
tags[17]        = 'теплопрочность холодопрочность холод тепло камера холода и тепла КХТ-0,16-02';
description[17] = 'Испытания полным грозовым импульсом';
address[17]     = 'https://etl.nstu.ru/src/vi4.html';

title[18]       = 'Переводческие услуги';
tags[18]        = 'перевод перевести перевода переводчик ';
description[18] = 'Испытания полным грозовым импульсом';
address[18]     = 'https://etl.nstu.ru/src/translate.html';


function contains(sub, s) {
    var strlen1 = sub.length;
    var strlen2 = s.length;
    var istrue  = false;
    for(var i = 0; i <= strlen2; i++) {
        comp = s.substring(i - 1, strlen2);
        comp = comp.substring(0, strlen1);
        if(comp == sub) {
            istrue = true;
            break;  
        }   
    }

    return istrue;
}

function dolt() {
    var loopCount = 0;
    var Found     = false
    var Item      = document.forms[0].sub.value.toLowerCase();

    var stats ='toolbar = no, location = no, scrollbars = yes, directories = no, status = yes, menubar = no, scrollbars = yes, resizable = yes, height = 500, width = 790, top = 20, left = 20'

    MsgBox = window.open('', 'msgWindow', stats) 
    MsgBox.opener      = window;
    MsgBox.opener.name = 'opener';
    MsgBox.document.write('<!DOCTYPE html><html><head><title>Результат поиска слова: ' + Item + '</title></head><body>');

    if (document.finding.sub.value == '') {
        MsgBox.document.write('<h5><font face="Arial">Список всех ссылок:<hr></h5></font>');
    }
    else {
        MsgBox.document.write('<h5><font face="Arial">Результаты поиска слова: "' + Item + '":<hr></h5></font>');
    }

    for (var i = 1; i <= sum; i++) {
        contains(Item, tags[i].toLowerCase());
        if (comp == Item) {
            loopCount++;
            Found = true;

            MsgBox.document.write('<div align="center"><table border="0" width="740" cellpadding="8"><tr><td width="2%" align="center"><font face="Arial" size="2">' + loopCount + '.</font></td><td width="98%" height="18" align="left"><font face="Arial" size="2"><a href="' + address[i] + '" target="_blank"><strong>' + title[i] + '</strong></a></font><br /><font face="Arial" size="2">' + description[i] + '<br /><i>Адрес страницы: ' + address[i] + '</i></font></td></tr></table></div>');
            MsgBox.document.write('<script type="text/javascript">window.status=(' + loopCount + ')</script>');
        }
    }

    if (!Found) {
        MsgBox.document.write('<font face="Arial">Совпадений не найдено.</font>');
    }

    //MsgBox.document.write('<hr><font face="Arial">Поиск по сайту на JavaScript</font></body></html>');
    if (loopCount == 0) {
        MsgBox.document.write('<script type="text/javascript">window.status=(0)</script>');
    }
}